Проверим, что у вас подключена возможность работы с SQL

In [17]:
!pip install ipython-sql #не обязательно запускать в colab

Requirement already satisfied: ipython-sql in ./opt/anaconda3/lib/python3.9/site-packages (0.4.1)
Requirement already satisfied: sqlparse in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: ipython-genutils>=0.1.0 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: six in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: decorator in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: appnope in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: pickleshare in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pygments in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: matplotlib-inline in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: pexpect>4.3 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: traitlets>=4.2 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: backcall in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: jedi>=0.16 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in ./opt/anaconda3/lib/python3.9/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: ptyprocess>=0.5 in ./opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in ./opt/anaconda3/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in ./opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)

In [18]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Создадим таблицу специальностей со следующими полями:
1. id - уникальный идентификатор специальности
2. Name - Специальность

In [19]:
%%sql 
drop table if exists Students;
drop table if exists Specialities;

CREATE TABLE Specialities
(
    id integer primary key, 
    Name varchar(50)
);

 * sqlite://
Done.
Done.
Done.

[]

Проверим, что таблица создана

In [20]:
%sql select * from Specialities

 * sqlite://
Done.

[]

Заполним таблицу данными

In [21]:
%%sql
insert Into Specialities(id, name) values (1, 'Биотехнические системы и технологии');
insert Into Specialities(id, name) values (2, 'Компьютерная безопасность');
insert Into Specialities(id, name) values (3, 'Прикладная математика и информатика');
insert Into Specialities(id, name) values (4, 'Мехатроника и робототехника');
insert Into Specialities(id, name) values (5, 'Системный анализ и управление');
insert Into Specialities(id, name) values (6, 'Информационная безопасность телекоммуникационных систем');
insert Into Specialities(id, name) values (7, 'Управление в технических системах');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

SQLite требует включение поддержки внешних ключей.
Более подробно можно посмотреть [здесь](https://sqlite.org/foreignkeys.html)

In [22]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite://
Done.

[]

Создадим таблицу Студентов со следующими полями:
1. Student_id - уникальный идентификатор студента
2. Name - имя студента
3. Second Name - фамилия студента
4. Speciality - специальность студента
5. StudyGroup - группа студента 
6. GPA - средний балл

In [23]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50),
    Speciality_id integer ,
    StudyGroup varchar(20),
    GPA number,
    foreign key(Speciality_id) references Specialities(id)
);

 * sqlite://
Done.
Done.

[]

Проверим, что таблица создана

In [16]:
%%sql 
SELECT * FROM Students

 * sqlite://
Done.

[]

Заполним таблицу данными

In [24]:
%%sql
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (1, 'Альянов', 'Николай', 1, '04-20', 3.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (2, 'Крыгина', 'Ева', 1, '01-20', 4.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (3, 'Исаева', 'Анна', 1, '01-20', 4.75);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (4, 'Егоров', 'Павел', 2, '01-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (5, 'Тихомиров', 'Тимофей', 2, '03-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (6, 'Ширшов', 'Александр', 2, '06-20', 3.91);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (7, 'Фатеев', 'Максим', 3, '05-20', 3.8);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (8, 'Киселев', 'Петр',  3, '05-20', 3.5);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (9, 'Агашкина', 'Дарья', 4, '02-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (10, 'Горин', 'Олег', 5, '01-20', 3.89);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (11, 'Комарова', 'Виктория', 6, '02-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (12, 'Челыхов', 'Иван', 6, '06-20', 4.45);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (13, 'Назаров', 'Александр', 6, '06-20', 3.73);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (14, 'Горлова', 'Ксения', 7, '01-20', 5);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Проверим наличие данных

In [25]:
%sql select * from Students

 * sqlite://
Done.

[(1, 'Николай', 'Альянов', 1, '04-20', 3.58),
 (2, 'Ева', 'Крыгина', 1, '01-20', 4.58),
 (3, 'Анна', 'Исаева', 1, '01-20', 4.75),
 (4, 'Павел', 'Егоров', 2, '01-20', 4.83),
 (5, 'Тимофей', 'Тихомиров', 2, '03-20', 4.18),
 (6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (7, 'Максим', 'Фатеев', 3, '05-20', 3.8),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (9, 'Дарья', 'Агашкина', 4, '02-20', 4.18),
 (10, 'Олег', 'Горин', 5, '01-20', 3.89),
 (11, 'Виктория', 'Комарова', 6, '02-20', 4.83),
 (12, 'Иван', 'Челыхов', 6, '06-20', 4.45),
 (13, 'Александр', 'Назаров', 6, '06-20', 3.73),
 (14, 'Ксения', 'Горлова', 7, '01-20', 5)]

In [10]:
%sql select * from Specialities

 * sqlite://
Done.

[(1, 'Биотехнические системы и технологии'),
 (2, 'Компьютерная безопасность'),
 (3, 'Прикладная математика и информатика'),
 (4, 'Мехатроника и робототехника'),
 (5, 'Системный анализ и управление'),
 (6, 'Информационная безопасность телекоммуникационных систем'),
 (7, 'Управление в технических системах')]

## Задание 1. Напишите SQL-запрос, возвращающий фамилии всех студентов с именем Александр

In [11]:
%%sql


SELECT SecondName FROM students
WHERE Name = "Александр";

 * sqlite://
Done.

[]

## Задание 2. Выведите все названия специальностей, на которых учится хотя бы один студент со средним баллом не менее 4. Имя специальности должно встречаться один раз в выводе

In [12]:
%%sql


SELECT DISTINCT Specialities.Name AS Specialities FROM students
LEFT JOIN Specialities
    ON students.Speciality_id = Specialities.id
WHERE gpa > 4;

 * sqlite://
Done.

[]

## Задание 3. Вывести только тех студентов, фамилия которых начинается с буквы 'к', а в имени есть буква 'е'.

In [13]:
%%sql


SELECT name, secondname FROM students
WHERE secondname LIKE "К%" AND (name LIKE "%е%" OR name LIKE "%Е%");

 * sqlite://
Done.

[]

#### (выполнено с предположением, что буквы в задании определены без учета регистра)

## Задание 4. Вывести специальности (+ их средние баллы), количество групп в которых больше одной

In [34]:
%%sql


SELECT Specialities.name,  avg(gpa) AS AVG,  count(DISTINCT StudyGroup) AS Groups FROM students
LEFT JOIN Specialities
    ON students.Speciality_id = Specialities.id
GROUP BY Specialities.name
HAVING Groups >1;

 * sqlite://
Done.

[('Биотехнические системы и технологии', 4.303333333333334, 2),
 ('Информационная безопасность телекоммуникационных систем', 4.336666666666667, 2),
 ('Компьютерная безопасность', 4.306666666666667, 3)]

In [35]:
%%sql


SELECT Specialities.name,  avg(gpa) AS AVG,  count(*) AS Groups FROM students
LEFT JOIN Specialities
    ON students.Speciality_id = Specialities.id
GROUP BY Specialities.name
HAVING Groups >1;

 * sqlite://
Done.

[('Биотехнические системы и технологии', 4.303333333333334, 3),
 ('Информационная безопасность телекоммуникационных систем', 4.336666666666667, 3),
 ('Компьютерная безопасность', 4.306666666666667, 3),
 ('Прикладная математика и информатика', 3.65, 2)]

## Задание 5. Для всех специальностей вывести средний балл по специальности для студентов, в чьей фамилия вторая буква НЕ 'а', при условии, что количество таких студентов на специальности не менее 2. В обратном случае, специальность выводить не требуется

In [27]:
%%sql


SELECT Specialities.name,  avg(gpa) AS AVG, count(Specialities.name) AS Number_of_students FROM students
LEFT JOIN Specialities
    ON students.Speciality_id = Specialities.id
WHERE students.secondname NOT LIKE "_а%"
GROUP BY Specialities.name
HAVING Number_of_students >= 2;

 * sqlite://
Done.

[('Биотехнические системы и технологии', 4.303333333333334, 3),
 ('Информационная безопасность телекоммуникационных систем', 4.640000000000001, 2),
 ('Компьютерная безопасность', 4.306666666666667, 3)]